# Задание 1
# Создай список своих любимых животных. Добавь в него ещё одно животное, а потом выведи длину списка (сколько всего животных в списке).
print("Задание №1 \n")



# Задание 2.1 
# Используя цикл for, пройди по всем числам от 1 до 10 и выведи только те, которые делятся на 3.
print("-"*20)
print("Задание №2.1 \n")



# Задание 2.2
# Используя цикл while, выведи все числа от 10 до 1 в обратном порядке.
print("-"*20)
print("Задание №2.2 \n")



# Задание 3
# У тебя есть словарь с именами людей и их возрастами: {"Анна": 25, "Иван": 30, "Максим": 15}. 
# Напиши программу, которая проверяет, кто из них старше 18 лет, и выводит их имена.
print("-"*20)
print("Задание №3 \n")



# Задание 4
''' 
Создай список с именами друзей. Используй random.choice, 
чтобы случайным образом выбрать, кто из них будет помогать тебе с домашним заданием сегодня.
'''
print("-"*20)
print("Задание №4 \n")



# Задание 5
# Напиши функцию, которая принимает два числа и возвращает их сумму. Используй эту функцию, чтобы посчитать сумму чисел 5 и 8.
print("-"*20)
print("Задание №5 \n")



