# Задание №1
# Написать программу, которая выведет "Hello world!"
print("Задание №1 \n")



# Задание №2
# Создайте переменную name и дать ей твоё имя. Затем выведите на экран сообщение: "Привет, <name>!"
print("-"*20)
print("Задание №2 \n")



# Задание №3
# Создайте переменные a и b и присвойте им целые значения. Выведите их сумму, разность, умножение, деление, остаток.
print("-"*20)
print("Задание №3 \n")



# Задание №4
# Напишите программу, которая запрашивает у пользователя пароль. Если введённый пароль равен "admin", выведите "Доступ разрешен", иначе — "Неверный пароль".
print("-"*20)
print("Задание №4 \n")



# Задание №5
# Финансовый калькулятор
'''
Напишите программу, которая:

1. Запрашивает у пользователя желаемую сумму накоплений.
2. Спрашивает у пользователя, сколько он готов откладывать ежемесячно.
3. Вычисляет, за сколько месяцев удастся накопить желаемую сумму.
4. Выводит результат в формате:
    -Если накопления займут больше года, выводит сообщение: "На накопление потребуется более года".
    -Если меньше года, выводит: "На накопление потребуется <количество месяцев> месяцев".
'''
print("-"*20)
print("Задание №5 \n")


